Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `LoadBalancer` which is responsible for selecting service instances for a single Stork service
ja_jp: `LoadBalancer` Stork サービスのサービスインスタンスを選択する責任があります。

source: `Logged` is an interceptor binding.
ja_jp: `Logged` はインターセプターバインディングです。

source: `LoginService` is a secured callback handler which gets control once Quarkus OIDC completes the authorization code flow.
ja_jp: `LoginService` は保護されたコールバックハンドラーであり、Quarkus OIDC が認可コードフローを完了すると制御を引き継ぎます。

source: `Lucie` is the parameter of the message bundle interface method.
ja_jp: `Lucie` はメッセージバンドルインターフェースメソッドのパラメーターです。

source: `MAP_GETTER` handles how to retrieve data from the carrier map transporting the context.
ja_jp: `MAP_GETTER` は、コンテキストを転送するキャリアーマップからデータを取得する方法を処理します。

source: `MailTemplate.send()` triggers the rendering and, once finished, sends the e-mail via a `Mailer` instance.
ja_jp: `MailTemplate.send()` がレンダリングのトリガーとなり、終了すると `Mailer` のインスタンスを介してメールを送信します。

source: `Map<DotName, ClassInfo>` containing all interceptor bindings
ja_jp: すべてのインターセプターバインディングを含む `Map<DotName, ClassInfo>`

source: `Map<DotName, ClassInfo>` containing all qualifiers
ja_jp: すべての修飾子を含む `Map<DotName, ClassInfo>`

source: `Map<DotName, StereotypeInfo>` containing all stereotypes
ja_jp: すべてのステレオタイプを含む `Map<DotName, StereotypeInfo>`

source: `Map<String, Object>` config map produced with default config identifier, `default-pulsar-client`, `default-pulsar-consumer`, `default-pulsar-producer`.
ja_jp: デフォルトの設定識別子 (`default-pulsar-client`、 `default-pulsar-consumer`、 `default-pulsar-producer`) を使用して生成された `Map<String, Object>` 設定マップ

source: `Map<String, Object>` config map produced with identifier in the configuration or channel name
ja_jp: 設定内またはチャネル名内の識別子を使用して生成された `Map<String, Object>` 設定マップ

source: `MeterTag.expression` is also supported, but you have to implement the evaluation of the expression by creating a bean implementing `io.micrometer.common.annotation.ValueExpressionResolver` that can evaluate expressions.
ja_jp: `MeterTag.expression` もサポートされていますが、式の評価が可能な `io.micrometer.common.annotation.ValueExpressionResolver` を実装する Bean を作成し、式を評価する必要があります。

source: `MeterTag.resolver` can be used to extract a tag from a method parameter, by creating a bean implementing `io.micrometer.common.annotation.ValueResolver` and referring to this class: `@MeterTag(resolver=CustomResolver.class)`
ja_jp: `MeterTag.resolver` は、メソッドのパラメータからタグを抽出するために使用できます。これは、 `io.micrometer.common.annotation.ValueResolver` を実装する Bean を作成し、`@MeterTag(resolver=CustomResolver.class)` クラスを参照することで実現できます。

source: `Multi<X>`: Indicates a non-blocking method where the items emitted by the non-null `Multi` are sequentially sent to the client until completion or cancellation.
ja_jp: `Multi<X>`: null 以外の `Multi` によって発行された項目が完了またはキャンセルされるまでクライアントに順番に送信されるノンブロッキングメソッドを示します。

source: `MultipartFormDataInput` is a Quarkus REST (Server) type representing a received multipart request.
ja_jp: `MultipartFormDataInput` は、受信したマルチパートリクエストを表す Quarkus REST (Server) 型です。

source: `MultivaluedMap` allows you to send array values
ja_jp: `MultivaluedMap` は配列の値を送信することができます

source: `Mutiny.Session` (managed, reactive)
ja_jp: `Mutiny.Session` (マネージド、リアクティブ)

source: `Mutiny.StatelessSession` (stateless, reactive)
ja_jp: `Mutiny.StatelessSession` (ステートレス、リアクティブ)

source: `MutinyEmitter#send(Message msg)` method is deprecated in favor of following methods receiving `Message` for emitting:
ja_jp: MutinyEmitter#send(Message msg)` メソッドは非推奨となり、以下のメソッドが `Message` を受信して発信するようになりました。

source: `MyParser` is an alternative bean.
ja_jp: `MyParser` は代替 Beanです。

source: `MyTest*`: all classes whose simple name starts with `MyTest`
ja_jp: `MyTest*`: シンプル名が `MyTest` で始まるすべてのクラス

source: `MyTest.test*`: all classes whose simple name is `MyTest`, and in them, only methods starting with `test`
ja_jp: `MyTest.test*`: 単純な名前が `MyTest` であるすべてのクラス、およびその中で `test` で始まるメソッドのみ

source: `None` (no context)
ja_jp: `None` （コンテキストなし）

source: `None` (no context), unless neither the propagated nor cleared sets contain `Remaining`, in which case the default is `Remaining` (all non-explicitly listed contexts)
ja_jp: `None`（コンテキストなし）。ただし、伝播されたセットとクリアされたセットのどちらにも `Remaining` が含まれていない場合は、デフォルトで `Remaining` （明示されていないすべてのコンテキスト）となります

source: `OAuth2` providers such as `GitHub` do not return `IdToken`, the fact of the user authentication is implicit and is indirectly represented by the `access` token which represents an authenticated user authorizing the current Quarkus `web-app` application to access some data on behalf of the authenticated user.
ja_jp: GitHub` のような `OAuth2` プロバイダは `IdToken` を返さないため、ユーザー認証の事実は暗黙的なものであり、間接的に `access` トークンで表されます。これは、現在のQuarkus `web-app`アプリケーションに、認証されたユーザーに代わってデータにアクセスすることを許可する認証されたユーザーを表現します。

source: `ObjectId` can be difficult to use if you want to expose its value in your REST service. So we created Jackson and JSON-B providers to serialize/deserialize them as a `String` which are automatically registered if your project depends on either the Quarkus REST Jackson extension or the Quarkus REST JSON-B extension.
ja_jp: REST サービスでその値を公開する場合、 `ObjectId` の使用が困難になる可能性があります。 そこで、Quarkus REST Jackson エクステンションまたは Quarkus REST JSON-B エクステンションのいずれかに依存している場合は自動登録される `String` としてシリアル化/逆シリアル化するための Jackson および JSON-B プロバイダーを作成しました。

source: `ObjectId` can be difficult to use if you want to expose its value in your REST service. So we created Jackson and JSON-B providers to serialize/deserialize them as a `String` which are automatically registered if your project depends on either the RESTEasy Jackson extension or the RESTEasy JSON-B extension.
ja_jp: `ObjectId` は、REST サービスでその値を公開したい場合、使用するのが難しいことがあります。そこで、RESTEasy Jackson extensionまたはRESTEasy JSON-B extensionに依存するプロジェクトであれば自動的に登録される、 `String` としてシリアライズ/デシリアライズするJacksonおよびJSON-Bプロバイダを作成しました。

source: `ObjectId` can be difficult to use if you want to expose its value in your REST service. So we created Jackson and JSON-B providers to serialize/deserialize them as a `String` which are automatically registered if your project depends on either the RESTEasy Reactive Jackson extension or the RESTEasy Reactive JSON-B extension.
ja_jp: `ObjectId` は、REST サービスでその値を公開したい場合、使用するのが難しいことがあります。そこで、RESTEasy Jackson extensionまたはRESTEasy JSON-B extensionに依存するプロジェクトであれば自動的に登録される、 `String` としてシリアライズ/デシリアライズするJacksonおよびJSON-Bプロバイダを作成しました。

source: `ObserverRegistrationPhaseBuildItem` Example
ja_jp: `ObserverRegistrationPhaseBuildItem` の例

source: `OidcClientRequestFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with the `quarkus.resteasy-client-oidc-filter.client-name` configuration property. You can also select `OidcClient` by setting the `value` attribute of the `@OidcClientFilter` annotation.
ja_jp: `OidcClientRequestFilter` は、デフォルトでデフォルトの `OidcClient` を使用します。名前付きの `OidcClient` は、 `quarkus.resteasy-client-oidc-filter.client-name` 設定プロパティーで選択できます。 `@OidcClientFilter` アノテーションの `value` 属性を設定して `OidcClient` を選択することもできます。

source: `OidcClientRequestFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with a `quarkus.oidc-client-filter.client-name` configuration property.
ja_jp: `OidcClientRequestFilter` はデフォルトで `OidcClient` を使用します。名前付きの `OidcClient` は `quarkus.oidc-client-filter.client-name` という設定プロパティーで選択することができます。

source: `OidcClientRequestFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with a `quarkus.resteasy-client-oidc-filter.client-name` configuration property. You can also select `OidcClient` by setting the `value` attribute of the `@OidcClientFilter` annotation. The client name set through annotation has higher priority than the `quarkus.resteasy-client-oidc-filter.client-name` configuration property. For example, given <<use-oidc-clients,this>> `jwt-secret` named OIDC client declaration, you can refer to this client like this:
ja_jp: `OidcClientRequestFilter` は、デフォルトの `OidcClient` を使用します。名前付きの `OidcClient` は、 `quarkus.resteasy-client-oidc-filter.client-name` 設定プロパティーで選択できます。 `@OidcClientFilter` アノテーションの `value` 属性を設定して `OidcClient` を選択することもできます。アノテーションを使用して設定されたクライアント名は、 `quarkus.resteasy-client-oidc-filter.client-name` 設定プロパティーよりも優先されます。 たとえば、<<use-oidc-clients,this>> `jwt-secret` という名前の OIDC クライアント宣言では、このクライアントを次のように参照できます。

source: `OidcClientRequestReactiveFilter` delays an initial token acquisition until it is executed to avoid blocking an IO thread and it currently can only be registered with `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` annotation:
ja_jp: `OidcClientRequestReactiveFilter` は、IO スレッドのブロックを回避するため、実行されるまで最初のトークンの取得を遅らせ、現在は `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` アノテーションによってのみ登録することができます。

source: `OidcClientRequestReactiveFilter` delays an initial token acquisition until it is executed to avoid blocking an IO thread.
ja_jp: `OidcClientRequestReactiveFilter` は、IO スレッドのブロックを回避するために、最初のトークンの取得が実行されるまで遅延します。

source: `OidcClientRequestReactiveFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with the `quarkus.rest-client-oidc-filter.client-name` configuration property. You can also select `OidcClient` by setting the `value` attribute of the `@OidcClientFilter` annotation.
ja_jp: `OidcClientRequestReactiveFilter` は、デフォルトでデフォルトの `OidcClient` を使用します。名前付きの `OidcClient` は、 `quarkus.rest-client-oidc-filter.client-name` 設定プロパティーで選択できます。 `@OidcClientFilter` アノテーションの `value` 属性を設定して `OidcClient` を選択することもできます。

source: `OidcClientRequestReactiveFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with a `quarkus.oidc-client-reactive-filter.client-name` configuration property.
ja_jp: `OidcClientRequestReactiveFilter` は、デフォルトで `OidcClient` を使用します。名前付きの `OidcClient` は `quarkus.oidc-client-reactive-filter.client-name` という設定プロパティーで選択することができます。

source: `OidcClientRequestReactiveFilter` uses a default `OidcClient` by default. A named `OidcClient` can be selected with a `quarkus.rest-client-oidc-filter.client-name` configuration property. You can also select `OidcClient` by setting the `value` attribute of the `@OidcClientFilter` annotation. The client name set through annotation has higher priority than the `quarkus.rest-client-oidc-filter.client-name` configuration property. For example, given <<use-oidc-clients,this>> `jwt-secret` named OIDC client declaration, you can refer to this client like this:
ja_jp: `OidcClientRequestReactiveFilter` は、デフォルトの `OidcClient` を使用します。名前付きの `OidcClient` は、 `quarkus.rest-client-oidc-filter.client-name` 設定プロパティーで選択できます。 `@OidcClientFilter` アノテーションの `value` 属性を設定して `OidcClient` を選択することもできます。アノテーションを使用して設定されたクライアント名は、 `quarkus.rest-client-oidc-filter.client-name` 設定プロパティーよりも優先されます。 たとえば、<<use-oidc-clients,この>> `jwt-secret` という名前の OIDC クライアント宣言では、このクライアントを次のように参照できます。

source: `OidcClientRequestReactiveFilter`, `OidcClientRequestFilter` and `Tokens` producers will refresh the current expired access token if the refresh token is available. Additionally, `quarkus.oidc-client.refresh-token-time-skew` property can be used for a preemptive access token refreshment to avoid sending nearly expired access tokens which may cause HTTP 401 errors. For example if this property is set to `3S` and the access token will expire in less than 3 seconds then this token will be auto-refreshed.
ja_jp: `OidcClientRequestReactiveFilter`、 `OidcClientRequestFilter` および `Tokens` プロデューサーは、リフレッシュトークンが利用可能な場合、現在の期限切れアクセストークンをリフレッシュします。さらに、 `quarkus.oidc-client.refresh-token-time-skew` プロパティーは、HTTP 401 エラーの原因となる可能性のある期限切れ間近のアクセストークンの送信を避けるために、アクセストークンのリフレッシュを先取りして行うことに使用できます。たとえば、このプロパティーが `3S` に設定されていて、アクセストークンが 3 秒以内に期限切れになる場合、このトークンは自動的にリフレッシュされます。

source: `OidcClientRequestReactiveFilter`, `OidcClientRequestFilter` and `Tokens` producers will refresh the current expired access token if the refresh token is available. Additionally, the `quarkus.oidc-client.refresh-token-time-skew` property can be used for a preemptive access token refreshment to avoid sending nearly expired access tokens that might cause HTTP 401 errors. For example, if this property is set to `3S` and the access token will expire in less than 3 seconds, then this token will be auto-refreshed.
ja_jp: `OidcClientRequestReactiveFilter`、 `OidcClientRequestFilter`、および `Tokens` プロデューサーは、リフレッシュトークンが利用可能な場合、現在の期限切れのアクセストークンを更新します。 さらに、HTTP 401 エラーの原因となる可能性のある期限切れに近いアクセストークンの送信を回避するために、 `quarkus.oidc-client.refresh-token-time-skew` プロパティーを使用して事前にアクセストークンを更新できます。たとえば、このプロパティーが `3S` に設定されている場合、アクセストークンが 3 秒未満に失効し、このトークンは自動的に更新されます。

source: `OidcClientRequestReactiveFilter`, `OidcClientRequestFilter`, and `Tokens` producers refresh the current expired access token if a refresh token is available.
ja_jp: `OidcClientRequestReactiveFilter`、 `OidcClientRequestFilter`、および `Tokens` プロデューサーは、リフレッシュトークンが利用可能な場合、現在の期限切れアクセストークンを更新します。

source: `OidcClient` also supports the `urn:openid:params:grant-type:ciba` grant:
ja_jp: `OidcClient` は `urn:openid:params:grant-type:ciba` グラントもサポートします。

source: `OidcClient` can also help acquire the tokens by using grants that require some extra input parameters that cannot be captured in the configuration. These grants are `refresh_token` (with the external refresh token), `authorization_code`, and two grants which can be used to exchange the current access token, namely, `urn:ietf:params:oauth:grant-type:token-exchange` and `urn:ietf:params:oauth:grant-type:jwt-bearer`.
ja_jp: `OidcClient` は設定にはない特別な入力パラメーターを必要とするグラントを使用して、トークンの取得を支援することもできます。これらのグラントとは、 `refresh_token` （外部リフレッシュトークン付き）、 `authorization_code` 、および現在のアクセストークンを交換するために使用できる 2 つのグラント `urn:ietf:params:oauth:grant-type:token-exchange` および `urn:ietf:params:oauth:grant-type:jwt-bearer`です。

source: `OidcClient` can also help acquire tokens with grants that require additional input parameters that cannot be captured in the configuration.
ja_jp: `OidcClient` は、設定で捕捉できない追加の入力パラメーターを必要とするグラントでトークンを取得するのにも役立ちます。

source: `OidcClient` can also help with acquiring the tokens using the grants which require some extra input parameters which can not be captured in the configuration. These grants are `refresh token` (with the external refresh token), `token exchange` and `authorization code`.
ja_jp: `OidcClient` はグラントを使用してトークンの取得を支援することもできます。このグラントでは、設定に含まれない追加の入力パラメーターを必要とします。これらのグラントは `refresh token` (外部リフレッシュトークン)、 `token exchange` および `authorization code` です。

source: `OidcClient` can also help with acquiring the tokens using the grants which require some extra input parameters which can not be captured in the configuration. These grants are `refresh_token` (with the external refresh token), `authorization_code`, as well as two grants which can be used to exchange the current access token, `urn:ietf:params:oauth:grant-type:token-exchange` and `urn:ietf:params:oauth:grant-type:jwt-bearer`.
ja_jp: `OidcClient` は設定にはない特別な入力パラメータを必要とするグラントを使用して、トークンの取得を支援することもできます。これらのグラントとは、 `refresh_token` （外部リフレッシュ・トークン付き）、 `authorization_code` 、および現在のアクセストークンを交換するために使用できる2つのグラント`urn:ietf:params:oauth:grant-type:token-exchange` および `urn:ietf:params:oauth:grant-type:jwt-bearer`です。

source: `OidcClient` has to authenticate to the OpenID Connect Provider for the `client_credentials` and other grant requests to succeed. All the https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[OIDC Client Authentication] options are supported, for example:
ja_jp: `OidcClient` は、 `client_credentials` および他のグラントリクエストが成功するために OpenID Connect プロバイダーに対して認証する必要があります。 https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[OIDC Client Authentication] オプションはすべてサポートされています。以下に例を示します。

source: `OidcClient` is initialized at build time with the IDP token endpoint URL, which can be auto-discovered or manually configured. `OidcClient` uses this endpoint to acquire access tokens with token grants such as `client_credentials` or `password`, and to refresh tokens with a `refresh_token` grant.
ja_jp: `OidcClient` は、IDP トークンエンドポイント URL (自動検出または手動設定が可能) でビルド時に初期化されます。`OidcClient` はこのエンドポイントを使用して、 `client_credentials` や `password` などのトークングラントでアクセストークンを取得し、 `refresh_token` グラントでトークンをリフレッシュします。

source: `OidcClient` is initialized at build time with the IDP token endpoint URL, which can be auto-discovered or manually configured. `OidcClient` uses this endpoint to acquire access tokens by using token grants such as `client_credentials` or `password` and refresh the tokens by using a `refresh_token` grant.
ja_jp: `OidcClient` はビルド時に IDP トークンエンドポイント URL (自動検出または手動設定) で初期化され、このエンドポイントを使用して `client_credentials` や `password` などのトークングラントを使用してアクセストークンを取得し、 `refresh_token` グラントを使用してトークンを更新できます。

source: `OidcClient` is initialized at the build time with the IDP token endpoint URL which can be auto-discovered or manually configured and uses this endpoint to acquire access tokens using the token grants such as `client_credentials` or `password` and refresh the tokens using a `refresh_token` grant.
ja_jp: `OidcClient` は自動検出または手動で構成することができる IDP トークンのエンドポイント URL でビルド時に初期化され、このエンドポイントを使用して `client_credentials` または `password` トークングラントを使用してアクセストークンを取得し、 `refresh_token` グラントを使用してトークンを更新します。

source: `OidcClient` must authenticate to the OpenID Connect provider for the `client_credentials` and other grant requests to succeed. All the https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[OIDC Client Authentication] options are supported.
ja_jp: `client_credentials` やその他のグラントリクエストが成功するには、`OidcClient` が OpenID Connect プロバイダーに対して認証する必要があります。すべての link:https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[OIDC Client Authentication] オプションがサポートされています。

source: `OidcClient` will discover that the token endpoint URL is `http://localhost:8180/auth/realms/quarkus/protocol/openid-connect/tokens`.
ja_jp: `OidcClient` は、トークンのエンドポイント URL が `http://localhost:8180/auth/realms/quarkus/protocol/openid-connect/tokens` であることを検出します。

source: `OidcClients` can be used to retrieve the already initialized, named OIDC clients and create new OIDC clients on demand.
ja_jp: `OidcClients` を使用して、すでに初期化され、名前が付けられた OIDC クライアントを取得できるほか、必要に応じて新しい OIDC クライアントを作成できます。

source: `OidcRequestContextProperties` can be used to access request properties. Currently, you can use a `client_id` key to access the client tenant ID and a `grant_type` key to access the grant type that the OIDC client uses to acquire tokens.
ja_jp: `OidcRequestContextProperties` を使用してリクエストプロパティーにアクセスできます。現在、 `client_id` キーを使用してクライアントテナント ID にアクセスし、 `grant_type` キーを使用して、OIDC クライアントがトークンの取得に使用するグラントタイプにアクセスできます。

source: `OidcRequestContextProperties` can be used to access request properties. Currently, you can use a `client_id` key to access the client tenant id and a `grant_type` key to access the grant type which the OIDC client uses to acquire tokens.
ja_jp: `OidcRequestContextProperties` を使用して、リクエストプロパティーにアクセスできます。 現在、 `client_id` キーを使用してクライアントテナント ID にアクセスし、 `grant_type` キーを使用して、OIDC クライアントがトークンの取得に使用するグラントタイプにアクセスできます。

source: `OidcRequestContextProperties` can be used to access request properties. Currently, you can use a `tenand_id` key to access the OIDC tenant ID and a `grant_type` key to access the grant type that the OIDC provider uses to acquire tokens. The `grant_type` can only be set to either an `authorization_code` or `refresh_token` grant type when requests are made to the token endpoint. It is `null` in all other cases.
ja_jp: `OidcRequestContextProperties` を使用して、リクエストプロパティーにアクセスできます。 現在、 `tenand_id` キーを使用して OIDC テナント ID にアクセスし、 `grant_type` キーを使用して OIDC プロバイダーがトークンを取得するために使用するグラントタイプにアクセスできます。 トークンエンドポイントにリクエストする場合、 `grant_type` は `authorization_code` または `refresh_token` グラントタイプのいずれかにのみ設定できます。それ以外の場合は `null` になります。

source: `OidcRequestContextProperties` can be used to access request properties. Currently, you can use a `tenand_id` key to access the OIDC tenant id and a `grant_type` key to access the grant type which the OIDC provider uses to acquire tokens. The `grant_type` can only be set to either `authorization_code` or `refresh_token` grant type, when requests are made to the token endpoint. It is `null` in all other cases.
ja_jp: `OidcRequestContextProperties` を使用して、リクエストプロパティーにアクセスできます。 現在、 `tenand_id` キーを使用して OIDC テナント ID にアクセスし、 `grant_type` キーを使用して OIDC プロバイダーがトークンを取得するために使用するグラントタイプにアクセスできます。 トークンエンドポイントにリクエストする場合、 `grant_type` は `authorization_code` または `refresh_token` グラントタイプのいずれかにのみ設定できます。それ以外の場合は `null` になります。

source: `OidcRequestFilter` can customize a request body by preparing an instance of `io.vertx.mutiny.core.buffer.Buffer` and setting it on a request context, for example:
ja_jp: `OidcRequestFilter` は、 `io.vertx.mutiny.core.buffer.Buffer` のインスタンスを準備し、リクエストコンテキストに設定することで、リクエストボディをカスタマイズできます。次に例を示します。

source: `OidcRequestFilter` can customize the request body by updating it with a `String` or by preparing an instance of `io.vertx.mutiny.core.buffer.Buffer` and setting it on a request context, for example:
ja_jp: `OidcRequestFilter` は、 `String` で更新するか、 `io.vertx.mutiny.core.buffer.Buffer` のインスタンスを準備し、リクエストコンテキストに設定することで、リクエストボディをカスタマイズできます。次に例を示します。

source: `OidcResponseFilter` can customize a response body by preparing an instance of `io.vertx.mutiny.core.buffer.Buffer` and setting it as a property on a response context, for example:
ja_jp: `OidcResponseFilter` は、 `io.vertx.mutiny.core.buffer.Buffer` のインスタンスを準備し、それをレスポンスコンテキストのプロパティーとして設定することで、レスポンスボディをカスタマイズできます。次に例を示します。

source: `OidcResponseFilter` can customize a response body by preparing an instance of `io.vertx.mutiny.core.buffer.Buffer` and setting it on a response context, for example:
ja_jp: `OidcResponseFilter` は、 `io.vertx.mutiny.core.buffer.Buffer` のインスタンスを準備し、それをレスポンスコンテキストに設定することで、レスポンスボディをカスタマイズできます。例:

source: `OidcResponseFilter` can customize the response body by preparing an instance of `io.vertx.mutiny.core.buffer.Buffer` and setting it as a property on a response context, for example:
ja_jp: `OidcResponseFilter` は、 `io.vertx.mutiny.core.buffer.Buffer` のインスタンスを準備し、それを応答コンテキストのプロパティーとして設定することで、応答ボディをカスタマイズできます。次に例を示します。

source: `OidcTestClient` is used to acquire an access token, using one of the registered user's name and password, as well as the `audience` and `scope` parameters.
ja_jp: `OidcTestClient` は、登録済みユーザーの名前とパスワードのいずれかと、 `audience` および `scope` パラメーターを使用して、アクセストークンを取得するために使用されます。

source: `OidcTestClient` should be used to test applications accepting bearer tokens which will work for the endpoint developed in this tutorial as it supports both authorization code flow and bearer token authentication. You would need to use OIDC WireMock or `HtmlUnit` directly against the Auth0 dev tenant if only the authorization code flow was supported - in the latter case `HtmlUnit` test code would have to be aligned with how Auth0 challenges users to enter their credentials. If you like, you can copy the xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing-wiremock[HtmlUnit test fragment] from the documentation and experiment with it.
ja_jp: `OidcTestClient` は、認可コードフローとベアラートークン認証の両方をサポートしているため、このチュートリアルで開発したエンドポイントで動作するベアラートークンを受け入れるアプリケーションのテストに使用する必要があります。認証コードフローのみをサポートする場合は、OIDC WireMock を使用するか、 を Auth0 dev テナントに対して直接使用する必要があります。後者の場合、 のテストコードを Auth0 がユーザーに認証情報の入力を要求する方法に合わせる必要があります。もしよろしければ、ドキュメントにある `HtmlUnit` `HtmlUnit` xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing-wiremock[HtmlUnit テスト] をコピーして試してみてください。

source: `OidcTestClient` will itself find out the `Auth0` token endpoint address, client id and secret.
ja_jp: `OidcTestClient` は、 `Auth0` トークンのエンドポイントのアドレス、クライアント id、およびシークレットを検出します。

source: `OidcWiremockTestResource` can be used to emulate all OIDC providers.
ja_jp: `OidcWiremockTestResource` は、すべての OIDC プロバイダーをエミュレートするために使用できます。
